<?php get_header('serv'); ?>

    <!-- メイン -->
    <main id="main">


      <!-- 主記述部 -->
      <section class="main-description main-description-serv-sub">
        <div class="main-description-serv-sub">

          <h2 class="h2-serv-sub">プロジェクトマネージメント</h2>

          <!-- サービスにあたって -->
          <article class="servise-serv-sub">
            <h3 class="h3-serv-sub">サービスにあたって</h3>

            <h4 class="h4-serv-sub">開発様式について</h4>
            <p class="p-2-serv-sub regtext">
              私たちは「ウォター・フォール型」の開発様式をベースにプロジェクトマネージメントを行っています。
            </p>
            <p class="p-2-serv-sub regtext">
              近年「アジャイル型」の開発様式も発展し広がってまいりました。 <a href="https://agilemanifesto.org/iso/ja/manifesto.html" style="font-weight:600;color:#2b23ba"><strong>アジャイルソフトウェア開発宣言</strong></a>に表されている主張について、私たちは共感をもっております。<br/>
              ただ、この宣言に賛同したソフトウェア開発技法のいくつかでは「ウォター・フォール型」に対して成熟の余地がまだあるという認識です。<br/>
              特に「突き詰めていない段階」からの自由度の高い活動を行ないますが、最終製品が備える十分な品質保証の担保へ至る手法が発展途上にあります。
            </p>
            <p class="p-2-serv-sub regtext">
              この点に気をつけながら、アジャイルの分野で確認できてきている多くの有用な仕組みやツールの利用をさせていただいております。
            </p>

            <h4 class="h4-serv-sub">マネージメントの規模にかかわって</h4>
            <p class="p-2-serv-sub regtext">
              一つのプロジェクトをとってみると、数週間で完結するものから十数ヵ月費やすものまであります。<br/>
              また、プロジェクトを構成するチームは数人規模のものから百人を超えるチームまであります。さらには複数のチームでプロジェクトを構成することが一般的になっています。<br/>
              大規模なシステム開発においては、複数のプロジェクトがプロジェクト群を組むことも少なくありません。
            </p>
            <p class="p-2-serv-sub regtext">
              ここで考えなければならないことは、体制としてのプロジェクトの塊と、管理としてのプロジェクトマネージメントのカバーする範囲の関係です。<br/>
              複数のプロジェクトが管理対象であれば、その中の一つのプロジェクトは全体のマネージメントに従う必要があります。<br/>
              ある期間で完結するプロジェクトよりも、プロジェクトマネージメントの適用期間の方が長ければ、そのプロジェクトはその管理下に置かれるでしょう。
            </p>
            <p class="p-2-serv-sub regtext">
              私たちが任されるプロジェクトは、どのくらいのプロジェクトマネージメントのもとにありますか。<br/>
              もし、プロジェクト管理方法の造り込みまでもプロジェクトマネージメントの中に任されるのならば、プロジェクト遂行前にマネージメントが有効に働くための仕掛けを準備をする時間が必要です。
            </p>

            <h4 class="h4-serv-sub">システム開発文化とプロジェクトマネージメント</h4>
            <p class="p-2-serv-sub regtext">
              みなさまのシステム開発文化のもとで、その規範の中でプロジェクトマネージメントは形成されていきます。<br/>
              また、プロジェクトマネージメントが成熟していくことで、みなさまのシステム開発文化も成熟していきます。<br/>
              そういう意味で、「システム開発文化」と「プロジェクトマネージメント」は鶏と卵の関係にあるのかもしれません。
            </p>
            <p class="p-2-serv-sub regtext">
              私たちがプロジェクトマネージメントを任されるということは、みなさまのシステム開発文化を身に馴染ませてマネージメント活動を行うということであります。また、私たちのマネージメント活動が少なからずみなさまのシステム開発文化に影響を与えるでしょう。
            </p>
            <p class="p-2-serv-sub regtext">
              このお互いの「熟れ」には時間を要します。絶対にです。
            </p>

            <h4 class="h4-serv-sub">規範の正しらしさと従順性がすべて</h4>
            <p class="p-2-serv-sub regtext">
              私たちが扱っているシステムやプログラムの原理は、元をただせば数学の世界から来ています。<br/>
              だからソフトウェアやプログラムを縛る物理学的な法則は存在しません。
              それゆえ、私たちが学んできた物理学ではシステムの動作やプログラムのふるまいの正しさは確認できません。<br/>
              また数学に寄ってしても、実用規模のソフトウェアやプログラムは複雑すぎて、類推は行いますが、その正しさを容易に証明できるものはほぼ存在しません。<br/>
              だから、システムづくり、プログラムづくりにおいての正しさの証明は非常に難しいことです。
            </p>
            <p class="p-2-serv-sub regtext">
              しかし何かに寄らなければシステムづくりが成り立ちません。<br/>
              そこで私たちが頼っているのは、理論的には不完全ですが筋が通ったシステマチックな思考と行動の規範です。<br/>
              プロジェクトマネジメントもこの規範の中にあります。<br/>
              物理法則の制約では縛れない世界にあるので、ここでのルールは筋が通った「できるだけの、ただしらしさ」のある規範と、その規範に対する従順性が必要です。<br/>
              そして、この規範が備える人間性が、モノづくりの正しさと、作業効率と、品質の作りこみに大いに影響を与えます。
            </p>

          </article>

            <!-- 提供サービス -->
          <article class="servise-serv-sub">

            <h3 class="h3-serv-sub">提供サービス</h3>

            <h4 class="h4-serv-sub">システム構築のプロジェクトマネージメント</h4>
            <p class="p-2-serv-sub regtext">
              商取引活動や顧客サービスにかかわるシステム構築。<br/>
              また、構築に供する仕組みとプロダクトの開発。<br/>
              これらのプロジェクトマネジメントを承ります。
            </p>

            <h4 class="h4-serv-sub">サービスの提供方針</h4>
            <p class="p-2-serv-sub regtext">
              個別のご依頼内容についてご相談をお受けします。
            </p>

          </article>

        </div>
      </section>

    </main>

<?php get_footer('serv'); ?>