<?php get_header('serv'); ?>

    <!-- メイン -->
    <main id="main">


      <!-- 主記述部 -->
      <section class="main-description main-description-serv-sub">
        <div class="main-description-serv-sub">

          <h2 class="h2-serv-sub">コンサルテーション</h2>

          <!-- コンサルティング分野について -->
          <article class="servise-serv-sub">
            <h3 class="h3-serv-sub">コンサルティング分野について</h3>
            <p class="p-1-serv-sub regtext">
              私たちが主にコンサルティング提案を行っているのは次の２つです。<br/>
              それぞれ、IT利用者とIT製造者へのコンサルティングです。
            </p>

            <h5 class="h5-serv-sub">① システム化に関するコンサルティング</h5>
            <p class="p-3-serv-sub regtext">
              提供するサービスのシステム化の視点と、そのサービスを提供する業務の建付けに関するコンサルティング。
            </p>
            <h5 class="h5-serv-sub">② システム製作に関するコンサルティング</h5>
            <p class="p-3-serv-sub regtext">
              製品につながる直接的・間接的材料と制作活動の進め方のそれぞれに対して成熟レベルを上げていくためのコンサルティング。
            </p>

            <h4 class="h4-serv-sub">① システム化に関するコンサルティング</h4>
            <p class="p-2-serv-sub regtext">
              システム化の必要性を含めて、みなさまのサービスの在り方と業務改革に対するコンサルティングです。
            </p>
            <p class="p-2-serv-sub regtext">
              コンサルティングは各案件ごとに実施内容を決めていきますが、いくつかのアイディアを紹介します。
            </p>
            <ul class="ul-0-serv-sub regtext">
              <li>
                本当にみなさまが創るサービスにおいて有効なシステム化の案を探します。もし、システム化よりもより良いアイディアが生まれましたら、それが提案になりますのでもちろんシステム化の必要はありません。
              </li>
              <li>
                システム化のアイディアがいくつか見つかれば、それがみなさまにとって、みなさまのお客様にとって、より素晴らしいサービスになるようにシェープアップのお手伝いをします。そして、そのシステム化はみなさまが選ばれた適格な実現者に委ねられるものであり、私たち以外が最適者ならばその方々を提案します。
              </li>
              <li>
                新しいサービスを始めるとき、それに合わせた業務改革の提案をします。直接システムにかかわらない業務も、みなさまと関わりある方々の仕事についても変化があるかもしれません。全体最適で心地よいビジネスでスタートができるように業務の再設計のお手伝いします。
              </li>
            </ul>

            <h4 class="h4-serv-sub">② システム化に関するコンサルティング</h4>
            <p class="p-2-serv-sub regtext">
              システム開発の理想像のひとつは、どのような要望に対しても、常に最適かつすでに何度も使いこなされた手順で、素晴らしい使いこなされた材料をもとに、よい製品を提供できることです。
            </p>
            <p class="p-2-serv-sub regtext">
              使いこなされた手順と、使いこなされた材料。これが手にできれば、効率的な作業で、製造品質をコントールのもとに置きながら、安定した計画実施に乗って市場に製品を提供できるでしょう。
            </p>
            <p class="p-2-serv-sub regtext">
              そしてこれにより得られた計画的な余裕で、みなさまはさらに高次の成熟に向かうことができるはずです。
            </p>
            <p class="p-2-serv-sub regtext">
              この素晴らしい直接・間接原材料の用意の仕方。品質をコントロールしながら効率的に製造する製造方法の作り方。そしてこれらすべてを管理下に置いてコントロールできる体制や制度の育み方。
            </p>
            <p class="p-2-serv-sub regtext">
              これを進めていくための提案を行います。
            </p>

          </article>

          <!-- 提供サービス -->
          <article class="servise-serv-sub">

            <h3 class="h3-serv-sub">提供サービス</h3>

            <p class="p-1-serv-sub regtext">
              すべてのコンサルティングのサービスひとつ一つが、みなさまのみが持つ問題意識に対する、私たちからの個々の提案になります。
            </p>
            <p class="p-1-serv-sub regtext">
              まずはご相談から始めさせてください。
            </p>

          </article>

          <!-- サービスの提供方針 -->
          <article class="servise-serv-sub">

            <h3 class="h3-serv-sub">サービスの提供方針</h3>

            <p class="p-1-serv-sub regtext">
              全てのコンサルティング業務は準委任契約でお願いしております。
            </p>

          </article>

        </div>
      </section>

    </main>

<?php get_footer('serv'); ?>